In [1]:
import pandas as pd
import numpy as np
data={'student':['Jack','Mike','Rohan','Zubair'],'year':[1,2,3,1],'marks':[9.8,6.7,8,9.9]}
dataframe_1=pd.DataFrame(data)
dataframe_1

  student  year  marks
0    Jack     1    9.8
1    Mike     2    6.7
2   Rohan     3    8.0
3  Zubair     1    9.9

In [2]:
dataframe_1.head(2)

  student  year  marks
0    Jack     1    9.8
1    Mike     2    6.7

In [3]:
dataframe_1.tail(2)

  student  year  marks
2   Rohan     3    8.0
3  Zubair     1    9.9

Changing columns or arranging columns

In [4]:
dataframe_2=pd.DataFrame(data,columns=['student','marks','year'])
dataframe_2

  student  marks  year
0    Jack    9.8     1
1    Mike    6.7     2
2   Rohan    8.0     3
3  Zubair    9.9     1

In [5]:
dataframe_2['year']#accessing year column

0    1
1    2
2    3
3    1
Name: year, dtype: int64

In [6]:
dataframe_2['year'] == dataframe_2.year # another way of accessing of column

0    True
1    True
2    True
3    True
Name: year, dtype: bool

In [8]:
dataframe_2.loc[2]#accessing row

student    Rohan
marks          8
year           3
Name: 2, dtype: object

In [9]:
type(dataframe_2.loc[2])# returns as pandas series

pandas.core.series.Series

In [10]:
dataframe_2.loc[[2]]

  student  marks  year
2   Rohan    8.0     3

In [21]:
type(dataframe_2.loc[[2]]) #returns as pandas dataframe

pandas.core.frame.DataFrame

In [11]:
dataframe_3=pd.DataFrame(data,columns=['student','marks','year','gender'])
dataframe_3

  student  marks  year gender
0    Jack    9.8     1    NaN
1    Mike    6.7     2    NaN
2   Rohan    8.0     3    NaN
3  Zubair    9.9     1    NaN

In [12]:
dataframe_3[['gender']]=4
dataframe_3

  student  marks  year  gender
0    Jack    9.8     1       4
1    Mike    6.7     2       4
2   Rohan    8.0     3       4
3  Zubair    9.9     1       4

In [13]:
data5=pd.Series([2,3],index=[1,3])
dataframe_3[['gender']]=data5
dataframe_3

  student  marks  year  gender
0    Jack    9.8     1     NaN
1    Mike    6.7     2     2.0
2   Rohan    8.0     3     NaN
3  Zubair    9.9     1     3.0

In [14]:
dataframe_3['passed']=dataframe_3.marks>7
dataframe_3

  student  marks  year  gender  passed
0    Jack    9.8     1     NaN    True
1    Mike    6.7     2     2.0   False
2   Rohan    8.0     3     NaN    True
3  Zubair    9.9     1     3.0    True

In [15]:
del dataframe_3['gender'] #delete a column
dataframe_3

  student  marks  year  passed
0    Jack    9.8     1    True
1    Mike    6.7     2   False
2   Rohan    8.0     3    True
3  Zubair    9.9     1    True

In [16]:
dataframe_3.drop([0]) #delete a row

  student  marks  year  passed
1    Mike    6.7     2   False
2   Rohan    8.0     3    True
3  Zubair    9.9     1    True

In [17]:
dict_1={'fruits':{'apple':40,'orange':20,'bananas':25,'grapes':30},
      'vegetables':{'carrot':20,'beans':16,'peas':30,'onion':25}}
dataframe_4=pd.DataFrame(dict_1)
dataframe_4

         fruits  vegetables
apple      40.0         NaN
bananas    25.0         NaN
beans       NaN        16.0
carrot      NaN        20.0
grapes     30.0         NaN
onion       NaN        25.0
orange     20.0         NaN
peas        NaN        30.0

In [18]:
dataframe_4.T

            apple  bananas  beans  carrot  grapes  onion  orange  peas
fruits       40.0     25.0    NaN     NaN    30.0    NaN    20.0   NaN
vegetables    NaN      NaN   16.0    20.0     NaN   25.0     NaN  30.0

In [19]:
dict_1={'fruits':{'apple':40,'orange':20,'bananas':25,'grapes':30},
      'vegetables':{'carrot':20,'beans':16,'peas':30,'onion':25}}
dataframe_4=pd.DataFrame(dict_1)
for i, j in dataframe_4.iterrows():#iterations over row
    print(i,j)

apple fruits        40.0
vegetables     NaN
Name: apple, dtype: float64
bananas fruits        25.0
vegetables     NaN
Name: bananas, dtype: float64
beans fruits         NaN
vegetables    16.0
Name: beans, dtype: float64
carrot fruits         NaN
vegetables    20.0
Name: carrot, dtype: float64
grapes fruits        30.0
vegetables     NaN
Name: grapes, dtype: float64
onion fruits         NaN
vegetables    25.0
Name: onion, dtype: float64
orange fruits        20.0
vegetables     NaN
Name: orange, dtype: float64
peas fruits         NaN
vegetables    30.0
Name: peas, dtype: float64

In [20]:
dict_1={'fruits':{'apple':40,'orange':20,'bananas':25,'grapes':30},
      'vegetables':{'carrot':20,'beans':16,'peas':30,'onion':25}}
dataframe_4=pd.DataFrame(dict_1)
for i, j in dataframe_4.iteritems():# iteration over columns
    print(i,j)

fruits apple      40.0
bananas    25.0
beans       NaN
carrot      NaN
grapes     30.0
onion       NaN
orange     20.0
peas        NaN
Name: fruits, dtype: float64
vegetables apple       NaN
bananas     NaN
beans      16.0
carrot     20.0
grapes      NaN
onion      25.0
orange      NaN
peas       30.0
Name: vegetables, dtype: float64

In [21]:
dataframe_4.rename(str,columns={'fruits':'palam','vegetables':'kaikari'})
#declare name inside columns'originalname':'name to be renamed'

         palam  kaikari
apple     40.0      NaN
bananas   25.0      NaN
beans      NaN     16.0
carrot     NaN     20.0
grapes    30.0      NaN
onion      NaN     25.0
orange    20.0      NaN
peas       NaN     30.0